{
    "GENERAL" : {
        "OK" : "OK",
        "CANCEL": "CANCEL",
        "DONE": "DONE",
        "YES": "YES",
        "NO": "NO",
        "BACK": "Back"
    },
    "ERROR" : {
        "TITLE": "Error",
        "INSTANT_DATA": "There was a problem getting your Instant Budget results.",
        "INSTANT_INPUTS": "There was a problem getting your Instant Budget inputs.",
        "CUSTOM_DATA": "There was a problem getting your Custom Budget results.",
        "CUSTOM_INPUTS": "There was a problem getting your Custom Budget inputs.",
        "SAVINGS_DATA": "There was a problem getting your Savings Plan results.",
        "SAVINGS_INPUTS": "There was a problem getting your Savings Plan inputs.",
        "NOT_LOGGED_IN": "There was a problem with authenticating your session. Please sign in.",
        "TOO_MANY_UNKNOWN_ERRORS": "There were mulitple unknown errors during this session, please sign in again.",
        "RETRY": "Retry",
        "WARNING": "Warning",
        "TIMED_OUT_TOKEN": "Your access token has expired. Please sign in.",
        "SUPPORT": "Contact tech support.",
        "ZIP": "This Zip Code is unknown to our database.",
        "RECORD": "There was no record found in our database.",
        "REGISTRATION": "There was a problem creating your Detailed Instant Budget. Please complete the Instant Budget form again.",
        "UPDATE_USER": "We had a problem updating your account information.",
        "OFFLINE": "We could not retrieve your data while you are offline.",
        "OFFLINE_SUBMIT": "We can not sumbit your data while offline.",
        "OFFLINE_EDIT": "We could not open the form while offline.",
        "OFFLINE_POLICY": "We can not open this webpage while offline.",
        "TRY_AGAIN": "Something went wrong, try again.",
        "NO_CONNECTION": "The connection with the server was unsuccessful, check your internet connection and try again later."
    },
    "LANDING_CTRL" : {
        "HEADER": "Soft Stack Factory",
        "PRIVACY_POLICY": "Privacy Policy | ",
        "GET_STARTED": "GET STARTED",
        "TERMS_OF_USE": "Terms of Use | ",
        "LOGIN": "LOGIN",
        "ABOUT": "About",
        "COPYRIGHT": "2016 SSF"
    },
    "LOGIN_CTRL" : {
        "NAV_BAR_TITLE": "Login",
        "EMAIL_FIELD": "Email",
        "PASSWORD_FIELD": "Password",
        "SUBMIT_BUTTON": "LOGIN",
        "UPDATE_TITLE_MESSAGE": "Update Alert",
        "UPDATE_BODY_MESSAGE": "An update is ready for this application. Do you want to update now?",
        "UPDATE_YES_BUTTON": "@:GENERAL.YES",
        "UPDATE_NO_BUTTON": "@:GENERAL.NO",
        "REMEMBER_ME": "Remember me?",
        "ERROR": {
            "TITLE": "Login Error",
            "FAILED_MESSAGE": "Login Failed",
            "WRONG_INPUTS": "Wrong email or password",
            "UNKNOWN_ISSUE": "Something went wrong, try again.",
            "INTERNET_CONNECTION": "The connection with the server was unsuccessful, check your internet connection and try again later."
        }
    },
    "REGISTER_CTRL" : {
        "NAV_BAR_TITLE": "Register",
        "TITLE":"Register Now",
        "EMAIL_FIELD": "Email",
        "PASSWORD_FIELD": "Password",
        "SUBMIT_BUTTON": "REGISTER",
        "REPEAT_PASSWORD": "Repeat Password",
        "WARNING": "Warning",
        "EMAIL_TAKEN": "The email is already taken.",
        "ERROR_EMAIL": "Invalid Email",
        "ERROR_ALL_FIELDS": "Please fill in all required fields.",
        "ERROR_PASSWORDS_MATCH": "Passwords do not match.",
        "ERROR_UNSUCCESSFUL": "Please try again.",
        "EULA": "Accept Terms of Use",
        "EULA_BUTTON": "TERMS OF USE",
        "PASSWORD_POPUP": "Your password must contain at least<br>one of each of the following:<br>Upper and lower case letter<br>A number<br>A special character which include,<br>but not limited to: ! @ # $",
        "INVALID": {
            "TITLE": "Incomplete Form",
            "EULA": "Please accept our Terms of Use."
        }
    },
    "UPDATE_CTRL" : {
        "NAV_BAR_TITLE": "Register",
        "UPDATING": "Wait while we update your application"
    },
    "SETTINGS": {
        "LANGUAGES": {
            "ENGLISH": "English",
            "SPANISH": "Spanish",
            "CHINESE": "Chinese (Mandarin)",
            "LANGUAGE": "Languages"
        },
        "CREDITS": {
            "HEADER": "Credits"
        },
        "TITLE": "Settings"
    },
    "EULA": {
        "1": "TERMS OF USE",
        "2": "Last Modified: May 12, 2015",
        "3": "This website is operated by SSF, Inc. (the \"Company\", \"We\", or \"US\"). By accessing this website, you agree to be bound by, and subject to, these Terms of Use.",
        "4": "ACCEPTANCE OF THE TERMS OF USE",
        "5": "These terms of use, together with any documents referred to herein (collectively, these \"Terms of Use\"), apply to your use of this website including any content, functionality, or services on or through www.SSF.com or any SSF, Inc. affiliated website (the \"Website\"), whether as a guest or a registered user.",
        "6": "Please read these Terms of Use carefully before you start to use the Website. By using the Website, you accept and agree to be bound and abide by these Terms of Use. If you do not want to agree to these Terms of Use, you must not access or use the Website.",
        "7": "ABILITY TO ACCEPT TERMS OF USE",
        "8": "You affirm that you are at least 18 years of age and are fully able and competent to enter into the terms, conditions, obligations, affirmations, representations, and warranties set forth in these Terms of Use, and to abide by and comply with these Terms of Use. If you are under 18 years of age, you should not use this Website unless supervised by an adult who agrees to be bound by these Terms of Use.",
        "9": "In any case, you affirm that you are over the age of 13, as the Website is not intended for children under 13. We do not knowingly collect personal information from any child under the age of thirteen (13).",
        "10": "PRIVACY & SECURITY",
        "11": "All information we collect is subject to our Privacy Policy. Our Privacy Policy is available at Privacy Policy. By using the Website, you authorize and consent to all actions taken by us with respect to your information in compliance with the Privacy Policy.",
        "12": "To access some features of the Website, you may have to create an account. You may never use another’s account without permission. When creating your account, you agree to provide accurate, current, and complete information. You are solely responsible for the activity that occurs on your account and you must keep your account password secure. You must notify the Company immediately of any breach of security or unauthorized use of your account. Although the Company will not be liable for your losses caused by any unauthorized use of your account, you agree to defend and indemnify the Company or others for the losses due to such unauthorized use.",
        "13": "By using this site you acknowledge that Internet transmissions are never completely private or secure. You understand that any message or information you send to the Website may be read or intercepted by others, notwithstanding the Company’s efforts to protect such transmissions. Further, the Company is not responsible for the privacy practices employed by other sites that may be linked to the Website.",
        "14": "As a condition of your use of the Website, you agree that you will not take any action intended to: (i) access data that is not intended for you; (ii) invade the privacy of, obtain the identity of, or obtain any personal information about any customer or user of the Website; (iii) probe, scan, or test the vulnerability of the Website or the Company network or breach security or authentication measures without proper authorization; (iv) attempt to interfere with service to any user, host, or network or otherwise attempt to disrupt the Company’s business via means of, including but not limited to, submitting a virus to the Website, \"overloading,\" \"flooding,\" \"spamming,\" \"mail bombing,\" or \"crashing;\" (v) send unsolicited mail, including promotions and/or advertising of products and services. Violations of system or network security may result in civil or criminal liability.",
        "15": "INTELLECTUAL PROPERTY RIGHTS",
        "16": "The content on the Website, including without limitation, the text, software, scripts, html code, graphics, photos, sounds, music, videos, interactive features, and the like (\"Content\") and the trademarks, service marks, domain names, and logos contained therein (\"Marks\"), are owned by or licensed to Us, subject to copyright and other intellectual property rights under United States law, foreign law, and international conventions. Content on the Website is provided to you AS IS for your information and personal use only and may not be used, copied, reproduced, distributed, transmitted, broadcast, displayed, sold, licensed, or otherwise exploited for any other purposes whatsoever without the prior written consent of the Company. The Company reserves all rights not expressly granted in and to the Website, Content, and Marks.",
        "17": "ELECTRONIC COMMUNICATIONS",
        "18": "When you visit the Website or send emails to the Company, you are communicating with us electronically and consent to receiving communications from us electronically pursuant to our E-Consent policy. We will communicate with you by email or by posting notices on this Website. You agree that all agreements, notices, disclosures, and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing to the extent permissible by law. You agree that we may send emails to you for the purpose of advising you about changes or additions to the Website, any of our products or services, or for such other purposes as we deem appropriate and as permissible by law.",
        "19": "CORRECTION OF ERRORS; CHANGES TO THE WEBSITE",
        "20": "The information and material presented on or through the Website may contain inaccuracies, typographical errors, or be incomplete. We reserve the right to amend any inaccuracies, errors, or omissions in our sole discretion without notice to you. We may make material changes to the Website at any time, in our sole discretion without notice to you. Further, We reserve the right to suspend access to the Website or close it indefinitely.",
        "21": "LINKS FROM THE WEBSITE",
        "22": "If the Website contains links to other sites and resources provided by third parties, these links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources, and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any third party sites linked to the Website, you do so entirely at your own risk and subject to the terms and conditions of use for such sites.",
        "23": "GEOGRAPHIC RESTRICTIONS",
        "24": "We provide the Website for use only by persons located in the United States. We make no claims that the Website or any of its content is accessible or appropriate outside of the United States. Access to the Website may not be legal by certain persons or in certain countries. If you access the Website from outside of the United States, you do so on your own initiative and are responsible for compliance with local laws.",
        "25": "PRODUCTS AND SERVICES SUBJECT TO ACCEPTANCE BY COMPANY",
        "26": "Any product or service on the Website may have exclusions, limitations, or restrictions under which it may not be available to you. Your eligibility for particular products and services on the Website is subject to the final determination and acceptance by the Company. The Company makes no solicitation to any person in any jurisdiction where the information, products, or services provided through the Website are prohibited by law.",
        "27": "NO FIDUCIARY RELATIONSHIP",
        "28": "You agree that no client, advisory, professional, or fiduciary relationship is created, implied, or established between you and the Company by use of the Website. You agree and understand that in connection with the Website, the Company is not engaged in rendering auditing, accounting, financial, investment, tax, or legal advice and that you will consult an appropriate licensed professional for advice relating to the specific facts that may apply to you. This includes, but is not limited to, the use of any of our financial wellness tools which may include the SSFScore™ and any materials in our financial wellness library.",
        "29": "OFFERS & PROMOTIONS",
        "30": "Any and all offers or promotions advertised on the Website are void where prohibited and are subject to the posting of any official rules pertaining to such offers or promotions.",
        "31": "DISCLAIMER OF WARRANTIES",
        "32": "YOUR USE OF THE WEBSITE IS AT YOUR OWN RISK. THE WEBSITE IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED.",
        "33": "NEITHER THE COMPANY, NOR ANY PERSON OR ENTITY ASSOCIATED WITH THE COMPANY MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY, OR COMPLETENESS OF THE WEBSITE'S CONTENT OR THE CONTENT OF ANY SITES LINKED TO BY THE WEBSITE. THE COMPANY, NOR ANY PERSON OR ENTITY ASSOCIATED WITH THE COMPANY, ASUMES NO LIABILITY OR RESPONSIBILITY FOR ANY (I) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT; (II) DAMAGES, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE WEBSITE; (III) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE WEBSITE; (IV) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE WEBSITE BY ANY THIRD PARTY.",
        "34": "THE COMPANY HEREBY DISCLAIMS ALL WARRANTIES OF ANY KIND RELATING TO THE WEBSITE OR ANY OF OUR PRODUCTS OR SERVICES, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT, AND FITNESS FOR PARTICULAR PURPOSE. WITHOUT LIMITING THE FOREGOING, THIS DISCLAIMER DOES NOT APPLY TO ANY PRODUCT WARRANTY OFFERED BY THE MANUFACTURER OF A PURCHASED ITEM.",
        "35": "THE FOREGOING DOES NOT AFFECT ANY WARRANTIES WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW.",
        "36": "LIMITATION OF LIABILITY",
        "37": "IN NO EVENT WILL THE COMPANY, ITS OFFICERS, DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE, OR INABILITY TO USE THE WEBSITE, ANY SITES LINKED TO IT, OR ANY CONTENT, GOODS, OR SERVICES OBTAINED THROUGH THE WEBSITE OR ANY SITES LINKED TO IT INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES INCLUDING BUT NOT LIMITED TO PERSONAL INJURY, PAIN AND SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, OR LOSS OF DATA, WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT OR OTHERWISE, EVEN IF FORESEEABLE.",
        "38": "THE FOREGOING DOES NOT AFFECT ANY LIABILITY WHICH CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW. IF ANY PART OF THIS LIMITATION ON LIABILITY IS FOUND TO BE INVALID OR UNENFORCEABLE FOR ANY REASON, THEN THE AGGREGATE LIABILITY OF COMPANY OR ITS OFFICERS, DIRECTORS, EMPLOYEES, OR AGENTS UNDER SUCH CIRCUMSTANCES FOR LIABILITIES THAT OTHERWISE WOULD HAVE BEEN LIMITED SHALL NOT EXCEED ONE HUNDRED DOLLARS ($100).",
        "39": "WAIVER AND SEVERABILITY",
        "40": "No waiver by the Company of any term or condition set forth in these Terms of Use shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition. Any failure of the Company to assert a right or provision under these Terms of Use shall not constitute a waiver of such right or provision.",
        "41": "If any provision of these Terms of Use is held by a court of competent jurisdiction to be invalid, illegal, or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of these Terms of Use will continue in full force and effect.",
        "42": "CHANGES TO THE TERMS OF USE",
        "43": "The Company reserves the right to change these Terms of Use in its sole discretion, at any time without notice. All changes to these Terms of Use are effective immediately upon posting to the Website. Your use of the Website following any such change constitutes your agreement to be bound by the most recent Terms of Use. For this reason, you are expected to review these Terms of Use each time you use the Website.",
        "44": "ARBITRATION AND GOVERNING LAW",
        "45": "By accessing the Website, you agree that all disputes will be handled through arbitration as set forth in our Arbitration Provisions. Should there be a dispute between you and Company, the dispute will be resolved by a third party arbiter. You may opt-out of Our Arbitration Provisions by following the process set forth in the Arbitration Provisions.",
        "46": "All matters relating to the Website and these Terms of Use and any dispute or claim arising therefrom or related thereto, shall be governed by and construed in accordance with the internal laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule, whether of the State of Delaware or any other jurisdiction.",
        "47": "LIMITATION ON TIME TO FILE CLAIMS",
        "48": "ANY CAUSE OF ACTION OR CLAIM YOU MAY HAVE ARISING OUT OF OR RELATING TO THE WEBSITE OR THESE TERMS OF USE MUST BE COMMENCED WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES, OTHERWISE SUCH CAUSE OF ACTION OR CLAIM IS PERMANENTLY BARRED.",
        "49": "ENFORCEMENT OF TERMS OF USE",
        "50": "BY ACCESSING AND USING THE WEBSITE, YOU AGREE THAT YOUR ACCESS TO AND USE OF THIS WEBSITE IS SUBJECT TO THESE TERMS OF USE, AS WELL AS ALL APPLICABLE LAWS, AS GOVERNED AND INTERPRETED PURSUANT TO THE LAWS OF THE STATE OF DELAWARE."
    },
    "NETWORK": {
        "TITLE": "Internet Disconnected",
        "CONTENT": "The internet is disconnected on your device."
    },
    "VIEW_TITLES": {
        "ABOUT": "About SSF",
        "EULA": "Terms of Use",
        "PRIVACY_POLICY": "Privacy Policy",
        "SETTINGS": "Settings",
        "LOGIN": "Login",
        "REGISTER": "Register",
        "LANDING": "SSF Seed",
        "APP_NAME": "SSF Seed"
    },
    "SIDE_MENU" : {
        "HEADER": "SSF",
        "SIGN_OUT": "Sign Out",
        "SIGN_IN": "Sign In",
        "CONFIGURE": {
            "HEADER": "Configure",
            "ITEM1" : "Settings",
            "ITEM2" : "About SSF",
            "ITEM3" : "Terms of Use",
            "ITEM4" : "Feedback",
            "ITEM5" : "Privacy Policy"
        },
        "DIVIDER_1": {
            "HEADER": "SSF App",
            "1": "About One",
            "2": "About Two",
            "3": "About Three"
        },
        "DIVIDER_2": {
            "HEADER": "Configure",
            "1": "Settings",
            "2": "About SSF",
            "3": "Terms of Use",
            "4": "Feedback",
            "5": "Privacy Policy"
        }
    },
    "FORMS": {
        "PAGE_1": {
            
        },
        "PAGE_2": {
            
        },
        "PAGE_3": {
            
        },
        "SUBMIT": "Submit",
        "CONTINUE": "Continue"
    },
    "RESULTS": {
        "PAGE_1": {
            
        },
        "PAGE_2": {
            
        },
        "PAGE_3": {
            
        }
    },
    "WIZARDS": {
        "PAGE_1": {
            
        },
        "PAGE_2": {
            
        },
        "PAGE_3": {
            
        }
    }
}